admin/app/Controllers/Catalog/Information.php

SELECT *
FROM `ci_language`
WHERE `status` = 1
---
        }

        $languageModel = new LanguageModel();
        $data['languages'] = $languageModel->where('status', 1)->findAll();