admin/app/Controllers/Common/Header.php

SELECT *
FROM `ci_user`
WHERE `ci_user`.`user_id` = 1
---
    public function index()
    {

        $data['base']       = base_url();
        $data['site_url']   = base_url();
        $data['home']       = base_url('common/dashboard?user_token=' . $this->session->get('user_token'));
        $data['profile']    = base_url('common/profile', '?user_token=' . $this->session->get('user_token'));
        $data['logout']     = base_url('common/logout');
        $data['activity']   = base_url('report/report', '?user_token=' . $this->session->get('user_token'));
        $data['setting']    = base_url('setting/setting', '?user_token=' . $this->session->get('user_token'));
        $data['configName'] = $this->registry->get('config_name');

        $data['title']       = $this->document->getTitle();
        $data['description'] = $this->document->getDescription();
        $data['keywords']    = $this->document->getKeywords();
        $data['links']       = $this->document->getLinks();
        $data['styles']      = $this->document->getStyles();
        $data['scripts']     = $this->document->getScripts();

        $data['logged'] = $this->user->isLogged();

        $userModel = new UserModel();

        if ($this->user->isLogged() && $this->user->getID()) {
            $user_info = $userModel->find($this->user->getID());