admin/app/Controllers/Design/Translation.php

SELECT *
FROM `ci_language`
---

        $languageModel = new LanguageModel();

        $data['languages'] = $languageModel->findAll();

SELECT *
FROM `ci_language`
WHERE `ci_language`.`language_id` = '1'
---
    public function path()
    {
        $json = [];

        if ($this->request->getVar('language_id')) {
            $language_id = $this->request->getVar('language_id');
        } else {
            $language_id = 0;
        }

        $languageModel = new LanguageModel();

        $language_info = $languageModel->find($language_id);

SELECT *
FROM `ci_language`
WHERE `ci_language`.`language_id` = '1'
---
    public function translation()
    {
        $json = [];

        if ($this->request->getVar('language_id')) {
            $language_id = $this->request->getVar('language_id');
        } else {
            $language_id = 0;
        }

        if ($this->request->getVar('path')) {
            $route = $this->request->getVar('path');
        } else {
            $route = '';
        }

        $languageModel = new LanguageModel();

        $language_info = $languageModel->find($language_id);