admin/app/Controllers/Setting/Setting.php

    public function index()
    {
        $this->document->setTitle(lang('setting/setting.heading_title'));

        // Breadcrumbs
        $data['breadcrumbs'] = [];

        $data['breadcrumbs'][] = [
            'text' => lang('en.text_home'),
            'href' => site_url('common/dashboard?user_token=' . $this->request->getVar('user_token')),
            ];

        $data['breadcrumbs'][] = [
            'text' => lang('setting/setting.heading_title'),
            'href' => site_url('setting/setting?user_token=' . $this->request->getVar('user_token')),
            ];

        $data['action'] = site_url('setting/setting/edit?user_token=' . $this->request->getVar('user_token'));

        if ($this->request->getMethod() != 'post') {
            $settingInfo = $this->settingModel->findAll();
---
SELECT *
FROM `ci_setting`

        }

        $languageModel = new LanguageModel();
		$data['languages'] = $languageModel->findAll();
---
SELECT *
FROM `ci_language`

		}

        $currencyModel = new CurrencyModel();
		$data['currencies'] = $currencyModel->findAll();
---
SELECT *
FROM `ci_currency`