admin/app/Config/Events.php

     * If you delete, All System custom events will not work.
     */
    $eventsModel = new EventsModel();
    $results = $eventsModel->where(['status' => 1])->findAll();
---
SELECT *
FROM `ci_event`
WHERE `status` = 1