admin/app/Filters/EventsFilter.php

                    'ip'          => $request->getIPAddress(),
                ];

                $results = $eventsModel->where([
                    'status'  => 1,
                    'trigger' => '\\' . APP_NAMESPACE . '\Controllers\\' . $route . '\\before',
                ])->findAll();
---
SELECT *
FROM `ci_event`
WHERE `status` = 1
AND `trigger` = '\\Admin\\Controllers\\Setting\\Setting\\Edit\\before'

                    'ip'          => $request->getIPAddress(),
                ];

                $results = $eventsModel->where([
                    'status'  => 1,
                    'trigger' => '\\' . APP_NAMESPACE . '\Controllers\\' . $route . '\\after',
                ])->findAll();
---
SELECT *
FROM `ci_event`
WHERE `status` = 1
AND `trigger` = '\\Admin\\Controllers\\Common\\Login\\Authlogin\\after'