catalog/app/Models/Catalog/InformationModel.php

SELECT *
FROM `ci_information` `i`
LEFT JOIN `ci_information_description` `id` ON `i`.`information_id` = `id`.`information_id`
WHERE `i`.`information_id` = 1
AND `id`.`language_id` = '1'
---
    public function getInformation(int $information_id)
    {
        $builder = $this->db->table('information i');

        $builder->select();
        $builder->join('information_description id', 'i.information_id = id.information_id', 'left');
        $builder->where('i.information_id', $information_id);
        $builder->where('id.language_id', service('registry')->get('config_language_id'));
        $query = $builder->get();