admin/app/Events/StartupEvent.php

    public static function index()
    {
        $registry = Services::registry();
        $language = Services::language();
        $request  = Services::request();

        // Settings
        $settingModel = new SettingModel();
        $settingData = $settingModel->findAll();
---
SELECT *
FROM `ci_setting`