catalog/app/Controllers/Common/Language.php

SELECT *
FROM `ci_language`
WHERE `status` = 1
---
    public function index()
    {
        if ($this->request->getCookie(config('Cookie')->prefix . 'language')) {
            $code = hex2bin($this->request->getCookie(config('Cookie')->prefix . 'language'));
        } else {
            $code = $this->locale;
        }

        $data['language_code'] = $code;

        $uri = '';
        // get URI Object parts
        $path      = $this->request->getUri()->getPath();
        $query     = $this->request->getUri()->getQuery();
        $scheme    = $this->request->getUri()->getScheme();
        $authority = $this->request->getUri()->getAuthority();
        $fragment  = $this->request->getUri()->getFragment();

        $data['languages'] = [];

        $languageModel = new LanguageModel();
        $results = $languageModel->where('status', 1)->findAll();